Repository: SeakyLuo/SMPlayer
Catalog: SMPlayer/Strings/*/Messages.resw
Source language: en_us
Languages: zh_cn

source: Adding lyrics stopped!
zh_cn: 已停止添加歌词！

# AddingLyricsTo
source: Adding lyrics to "{0}"...
zh_cn: 正在为《{0}》添加歌词……

# AddPreferredAlbumsToolTip
source: Right click on any album and then click "Set As Preferred" on the pop-up menu.
zh_cn: 右键任意专辑，在弹出菜单中选择【设为偏好】。

# AddPreferredArtistsToolTip
source: Right click on any artist and then click "Set As Preferred" on the pop-up menu.
zh_cn: 右键任意歌手，在弹出菜单中选择【设为偏好】。

# AddPreferredFoldersToolTip
source: Right click on any folder and then click "Set As Preferred" on the pop-up menu.
zh_cn: 右键任意文件夹，在弹出菜单中选择【设为偏好】。

# AddPreferredPlaylistsToolTip
source: Click "Set As Preferred" in any Playlist page.
zh_cn: 在任意播放列表的详情中点击【设为偏好】。

# AddPreferredSongsToolTip
source: Right click on any music and then click "Set As Preferred" on the pop-up menu.
zh_cn: 右键任意歌曲，在弹出菜单中选择【设为偏好】。

# AlbumArtSaved
source: New album art has been saved!
zh_cn: 新的专辑插图已保存！

source: Albums:
zh_cn: 专辑：

# AllArtists
source: All Artists: {0}
zh_cn: 歌手：{0}

# AuthorizeFolderFailed
source: Picked folder must be the same as your music folder!
zh_cn: 你选择的文件夹必须和你的音乐文件夹一致！

# AuthorizeSuccessful
source: Authorzation is successful!
zh_cn: 授权成功！

# ChangesSaved
source: Changes has been saved.
zh_cn: 已保存！

# CheckNewMusicResult1Added
source: "{0}" is added.
zh_cn: 添加了《{0}》

# CheckNewMusicResult1Removed
source: "{0}" is removed!
zh_cn: 移除了《{0}》

# CheckNewMusicResultMultipleAdded
source: Music added: {0}
zh_cn: 添加了{0}首歌

# CheckNewMusicResultMultipleRemoved
source: Music removed: {0}
zh_cn: 移除了{0}首歌

# CheckNewMusicResultNoChange
source: No changes have been found.
zh_cn: 没有检查到变化

# ClearExpiredData
source: Clearing expired data......
zh_cn: 正在清除过期数据……

# ClearPlayHistory
source: Do you want to clear your play history?
zh_cn: 你想清空播放历史吗？

# ClearPlaylist
source: Do you want to clear playlist "{0}"?
zh_cn: 你希望清空播放列表“{0}”吗？

# ClearSearchHistory
source: Do you want to clear your search history?
zh_cn: 你想清空搜索历史吗？

source: Click again to stop adding lyrics
zh_cn: 再次点击来中止添加歌词

source: Close
zh_cn: 关闭

source: Data exported
zh_cn: 数据已导出！

source: Data imported!
zh_cn: 数据已导入！

# DeleteFolder
source: You are deleting folder "{0}". This operation will also delete everything under this folder and is irrevertible. Are you sure?
zh_cn: 你将要删除文件夹“{0}”，此操作还会删除该文件夹下所有的文件夹和音乐，且不可撤销，是否确认？

# DeleteMusic
source: Delete "{0}"
zh_cn: 删除《{0}》

# DeleteMusicMessage
source: You are deleting "{0}" from your device.\nThis operation is not fully revertible.\nDo you want to continue?
zh_cn: 你将要删除《{0}》。该项操作无法完全撤销，是否要继续？

# DuplicateFoundWhenMovingFile
source: File "{0}" already exists in folder "{1}". Continue?
zh_cn: 文件夹“{1}”已经包含文件“{0}”，是否继续？

# Error
source: Error occurs
zh_cn: 发生了错误

# FailToGetThumbnail
source: Fail to get album art!
zh_cn: 无法获取专辑插图！

# FailToOpenBrowser
source: Fail to open web browser. Link has been copied to the clipboard.
zh_cn: 无法打开浏览器，链接已复制到剪贴板

# FolderIsDeleted
source: Folder "{0}" is deleted!
zh_cn: 文件夹“{0}”已被删除！

# FolderNotFound
source: Cannot find folder "{0}"!
zh_cn: 找不到文件夹“{0}”！

# Folders
source: Folders ({0})
zh_cn: 文件夹（{0}）

source: Folders:
zh_cn: 文件夹：

# GetLyricsFailed
source: Error getting lyrics, please try later
zh_cn: 获取歌词失败，请稍后再试

source: Go to Settings
zh_cn: 前往设置

# HasBeenPlayed
source: "{0}" has been played {1} {2}.
zh_cn: 《{0}》已经播放了{1}次。{2}

# ImportDataCancelled
source: You have cancelled data import.
zh_cn: 你已取消数据导入

source: Import data failed:
zh_cn: 导入数据失败：

source: Import lyrics failed.
zh_cn: 导入歌词失败

# ItemRemoved
source: "{0}" is removed
zh_cn: “{0}”已移除

# ItemsRemoved
source: {0} items have been removed!
zh_cn: {0}个项目已被移除！

# LoadMusicLibrary
source: Loading music library...
zh_cn: 正在加载音乐库……

# LoadSettingsAndInsertToDbFailed
source: Cannot write data into database. To avoid problems for your future use, please go to settings page and click "Feedback" to report this error.
zh_cn: 数据库写入失败，为避免影响后续使用，请在设置页面点击“提供反馈”并反馈问题。

# Lyrics
source: lryics
zh_cn: 歌词

# LyricsReset
source: Lyrics have been reset!
zh_cn: 歌词已重置！

# LyricsUpdated
source: Lyrics of "{0}" have been updated!
zh_cn: 《{0}》的歌词已更新！

# MiniModeFailed
source: Fail to enter mini mode!
zh_cn: 无法进入迷你模式！

# MusicDeleted
source: "{0}" is deleted!
zh_cn: 《{0}》已被删除！

# MusicNoAlbumArt
source: "{0}" does not have album art!
zh_cn: 《{0}》没有专辑插图！

# MusicNotFound
source: Cannot find music "{0}"
zh_cn: 找不到音乐《{0}》！

# MusicRemoved
source: "{0}" is removed
zh_cn: 《{0}》已被移除！

# MusicsNotFound
source: Skipped {0} songs as they cannot be found.
zh_cn: {0}首歌曲无法被找到。已跳过。

# NamingErrorEmptyOrWhiteSpace
source: Playlist name cannot be empty or whitespaces!
zh_cn: 名称不能为空！

# NamingErrorSpecial
source: Playlist name cannot contain "+++++" or "{0}"!
zh_cn: 名称中不能包含“+++++”或者“{0}”！

# NamingErrorTooLong
source: Playlist name cannot have more than 50 characters!
zh_cn: 名称长度不能超过50！

# NamingErrorUsed
source: This name has been used!
zh_cn: 该名称已被使用！

source: Never Mind
zh_cn: 算了

source: Next
zh_cn: 下一首

source: No
zh_cn: 否

source: No Playlist
zh_cn: 没有播放列表

source: No Lyrics Available
zh_cn: 没有歌词

# NoMusicUnderCurrentFolder
source: There is no music file found under the current folder!
zh_cn: 当前目录下没有音乐！

# NoResult
source: No result can be found!
zh_cn: 找不到结果

# NotImplemented
source: This feature is not implemented yet!
zh_cn: 暂时没有实现该功能！

# NotPlayedYet
source: "{0}" has not been played yet.
zh_cn: 《{0}》尚未被播放。

# NowLoading
source: I am still loading. Please try later.
zh_cn: 正在加载，请稍后再试

# OpenBrowserSuccessful
source: Fail to find matching lyrics. Open a web browser instead.
zh_cn: 搜不到匹配歌词，已打开浏览器进行搜索

# OpenSettingsAndTurnOnSpeechInput
source: You need to open the system settings, and then turn on a switch under 'Get to know me'.
zh_cn: 你需要打开设置，并且打开“开始了解你”下的开关

# OpenSettingsFailed
source: Unable to open system settings!
zh_cn: 无法打开系统设置

# PathNotFound
source: Path {0} does not exist!
zh_cn: 路径{0}不存在！

source: Pause
zh_cn: 暂停

source: Play
zh_cn: 播放

# PlaylistRemoved
source: "{0}" is removed
zh_cn: 播放列表“{0}”已移除

source: Playlists:
zh_cn: 播放列表：

# PlayRandomAlbum
source: Now playing music from album "{0}".
zh_cn: 正在播放专辑《{0}》的歌曲

# PlayRandomArtist
source: Now playing music from artist "{0}".
zh_cn: 正在播放歌手“{0}”的歌曲

# PlayRandomLocalFolder
source: Now playing music from folder "{0}".
zh_cn: 正在播放文件夹“{0}”的歌曲

# PlayRandomPlaylist
source: Now playing music from playlist "{0}".
zh_cn: 正在播放播放列表“{0}”的歌曲

# PleaseExitMultiSelectMode
source: Please exit multi-select mode first!
zh_cn: 请先退出多选模式！

# ProcessingRequest
source: I am processing your previous request. Please try later!
zh_cn: 正在处理您的请求，请稍后再试

# ProcessRequest
source: Processing your request......
zh_cn: 正在处理您的请求……

# PropertiesReset
source: Properties is reset!
zh_cn: 歌曲信息已重置！

# PropertiesUpdated
source: Properties is updated!
zh_cn: 歌曲信息已更新！

# RemoveAlbumArt
source: Do you want to remove the album art of "{0}"?
zh_cn: 你想要移除《{0}》的专辑插图吗？

# RemoveFromList
source: Remove "{0}" from the list
zh_cn: 将《{0}》从列表中移除

# RemoveFromPlaylist
source: Remove "{0}" from playlist
zh_cn: 将《{0}》从播放列表中移除

# RemoveItem
source: Do you want to remove "{0}"?
zh_cn: 你想要移除“{0}”吗？

# RemoveItems
source: You are going to remove {0} items. Continue?
zh_cn: 你即将移除{0}个项目，是否继续？

# RemoveMusic
source: Do you want to remove "{0}" from your playlist?
zh_cn: 你想要移除《{0}》吗？

# RemoveMusicList
source: You are about to remove {0} songs from the playlist. This operation cannot be undone. Do you want to continue?
zh_cn: 你即将从播放列表中移除{0}首歌，该操作无法撤销，是否继续？

# RemovePlaylist
source: Do you want to remove playlist "{0}"?
zh_cn: 你想要移除播放列表“{0}”吗？

source: Repeat One: Disabled
zh_cn: 单曲循环：关闭

source: Repeat One: Enabled
zh_cn: 单曲循环：打开

source: Repeat: Disabled
zh_cn: 循环播放：关闭

source: Repeat: Enabled
zh_cn: 循环播放：打开

# ResyncData
source: Sychronizing data changes......
zh_cn: 正在同步数据……

source: Reverse Playlist
zh_cn: 使播放列表倒序

source: Reverse List
zh_cn: 倒序排列

# RootNotFound
source: Cannot find music folder. Please reset it.
zh_cn: 找不到音乐文件夹，请重新设置

# SameFolderAlreadyExists
source: Folder with the same name already exists!
zh_cn: 同名文件夹已经存在！

source: Search
zh_cn: 搜索

# SearchDirectoryHint
source: Search under ""
zh_cn: 在“{0}”中搜索

# SearchDirectoryResult
source: Search result of "{0}" under "{1}"
zh_cn: ”{0}“在“{1}“中的搜索结果

# SearchEmpty
source: Search content cannot be empty!
zh_cn: 搜索内容不能为空！

# SearchLyricsDone
source: Lyrics have been added to all music.
zh_cn: 已为所有歌曲添加歌词

# SearchLyricsFailed
source: Unable to find matching lyrics!
zh_cn: 无法找到匹配歌词！

# SearchLyricsSuccessful
source: Matching lyrics are found! You need to save it manually.
zh_cn: 已找到匹配歌词，你需要手动保存

# SearchLyricsUrl
source: https://www.bing.com/search?q={0}+{1}+{2}
zh_cn: https://cn.bing.com/search?q={0}+{1}+{2}

# SearchResult
source: Search result of "{0}"
zh_cn: ”{0}“的搜索结果

# SearchResultAlbum
source: Your request matches album “{0}”
zh_cn: 找到匹配的专辑《{0}》

# SearchResultArtist
source: Your request matches artist “{0}”
zh_cn: 找到匹配的歌手“{0}”

# SearchResultFolder
source: Your request matches folder “{0}”
zh_cn: 找到匹配的文件夹“{0}”

# SearchResultMusic
source: Your request matches music “{0}”
zh_cn: 找到匹配的歌曲“{0}”

# SearchResultPlaylist
source: Your request matches playlist “{0}”
zh_cn: 找到匹配的播放列表“{0}”

# SelectedItemsRemoved
source: Selected items have been removed!
zh_cn: 选中项已被移除！

# SetAsPreferredFailed
source: Operation failed. You have too many preferences to flirt with!
zh_cn: 操作失败，你已达到偏好数量的上限，别太花心哦

# SetItemAsPreferred
source: {0} has been set as preferred!
zh_cn: 已将“{0}”设为偏好！

# SetPlayNext
source: “{0}” will be played next
zh_cn: 已将《{0}》设为下一首播放的歌曲

# SetRootFolder
source: Please set your music library first!
zh_cn: 请先设置你的音乐文件夹！

source: Shuffle: Disabled
zh_cn: 随机播放：关闭

source: Shuffle: Enabled
zh_cn: 随机播放：打开

# SongAddedTo
source: "{0}" is added to "{1}"
zh_cn: 已将《{0}》添加到”{1}“

# Songs
source: Songs ({0})
zh_cn: 歌曲（{0}）

source: Songs:
zh_cn: 歌曲：

# SongsAddedTo
source: {0} songs are added to "{1}"
zh_cn: 已添加{0}首歌到”{1}“

source: Sort By Album
zh_cn: 根据专辑排序

source: Sort By Artist
zh_cn: 根据歌手排序

source: Sort By Date Added
zh_cn: 根据添加日期排序

source: Sort By Default
zh_cn: 默认排序

source: Sort By Duration
zh_cn: 根据时长排序

source: Sort By Name
zh_cn: 根据名称排序

source: Sort By Play Count
zh_cn: 根据播放次数排序

source: Sort By Title
zh_cn: 根据标题排序

# StopAddingLyrics
source: Trying to stop adding lyrics......
zh_cn: 正在尝试中止添加歌词……

source: Unable to change album art!
zh_cn: 无法更改专辑插图

# UnableToLocateMusic
source: Currently unable to locate music.
zh_cn: 暂时无法定位歌曲

# UnacceptedSpeechPrivacyPolicy
source: The speech privacy policy was not accepted
zh_cn: 尚未接受语音隐私政策

# UnauthorizedAccessException
source: Authorization is needed to access {0}!
zh_cn: 没有权限访问路径{0}！

# UndoPreferItem
source: {0} is no longer preferred.
zh_cn: 已取消“{0}”的偏好设置！

source: Unknown Album
zh_cn: 未知专辑

source: Unknown Artist
zh_cn: 未知歌手

# UpdateDBMsgInitDatabase
source: Initializing database......
zh_cn: 正在初始化数据库......

# UpdateDBMsgPreparing
source: Now preparing data to write, please WAIT for a couple of minutes, and do not exit.
zh_cn: 正在准备数据以写入，请稍等几分钟，不要退出……

# UpdateDBMsgUpdatingDatabase
source: Updating database...... Please do not exit.
zh_cn: 正在更新数据库，请勿退出

# UpdateFinished
source: Your data has been updated!
zh_cn: 数据更新完成！

# UpdateMusicLibrary
source: Updating your music library......
zh_cn: 正在更新音乐库……

# VoiceAssistantAudiblePrompt
source: How can I help you?
zh_cn: 请问需要什么帮助？

# VoiceAssistantCannotUnderstand
source: Sorry, I can't follow you. Could you please say that again?
zh_cn: 不好意思，我没听懂，可以再说一遍吗

# VoiceAssistantExampleText
source: You can say "play something", "pause", "help", e.t.c.
zh_cn: 你可以说“播放某某某”、“暂停”、“帮助”等等。

# VoiceAssistantNewVolume
source: You have the volume to {0}.
zh_cn: 音量已调整至{0}

# VoiceAssistantNoSearchResults
source: Sorry, I can't find result for "{0}".
zh_cn: 不好意思，找不到“{0}”相关的结果

# VoiceAssitantError
source: Sorry, something goes wrong.
zh_cn: 不好意思，出现了一些问题。

source: Yes
zh_cn: 是
